import { z } from "zod"

const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/

export const RegisterSchema = z.object({
  name: z.string().min(2, "الاسم يجب أن يكون أكثر من حرفين").max(100, "الاسم يجب أن يكون أقل من 100 حرف"),
  phone: z.string().min(10, "رقم الهاتف يجب أن يكون أكثر من 10 أرقام").max(15, "رقم الهاتف يجب أن يكون أقل من 15 رقم"),
  email: z.string().min(1, "البريد الإلكتروني مطلوب").email("أدخل بريداً إلكترونياً صالحاً"),
  password: z.string().min(1, "كلمة المرور مطلوبة").regex(passwordRegex, "كلمة المرور يجب أن تحتوي على عدد من الأحرف الكبيرة والصغيرة والأرقام والرموز"),
})