import { z } from "zod"

const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/

export const RegisterSchema = z.object({
  firstName: z.string().min(2, "الاسم الأول يجب أن يكون أكثر من حرفين").max(50, "الاسم الأول يجب أن يكون أقل من 50 حرف"),
  lastName: z.string().min(2, "اسم العائلة يجب أن يكون أكثر من حرفين").max(50, "اسم العائلة يجب أن يكون أقل من 50 حرف"),
  username: z.string().min(3, "اسم المستخدم يجب أن يكون أكثر من 3 أحرف").max(50, "اسم المستخدم يجب أن يكون أقل من 50 حرف"),
  email: z.string().min(1, "البريد الإلكتروني مطلوب").email("أدخل بريداً إلكترونياً صالحاً"),
  password: z.string().min(1, "كلمة المرور مطلوبة").regex(passwordRegex, "كلمة المرور يجب أن تحتوي على عدد من الأحرف الكبيرة والصغيرة والأرقام والرموز"),
})